andoma/mios/src/platform/stm32h7/stm32h7_eth.c
#include <assert.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include <mios/io.h>
#include <mios/eventlog.h>
#include <malloc.h>
#include <unistd.h>

#include <mios/driver.h>
#include <mios/type_macros.h>

#include <net/pbuf.h>
#include <net/ether.h>

#include <util/crc32.h>

#include "irq.h"
#include "stm32h7_clk.h"
#include "stm32h7_eth.h"

#define MAC_NAME "stm32h7-eth"

#define DMA_BUFFER_PAD 2

typedef struct {
  union {
    uint32_t w0;
    void *p0;
  };
  uint32_t w1;
  uint32_t w2;
  uint32_t w3;
} desc_t;

#define ETH_RDES3_OWN           0x80000000
#define ETH_RDES3_IOC           0x40000000
#define ETH_RDES3_FD            0x20000000
#define ETH_RDES3_LD            0x10000000
#define ETH_RDES3_BUF2V         0x02000000
#define ETH_RDES3_BUF1V         0x01000000

#define ETH_RDES3_CTX           0x40000000
// Status bits in RDES3 write-back format, valid when LD is set
#define ETH_RDES3_CE            0x01000000  // CRC error
#define ETH_RDES3_OE            0x00200000  // Rx FIFO overflow (partial pkt)
#define ETH_RDES3_ES            0x00008000  // Error summary

#define ETH_TDES3_OWN           0x80000000
#define ETH_TDES3_FD            0x20000000
#define ETH_TDES3_LD            0x10000000

#define SYSCFG_BASE 0x58000400


#define ETH_BASE 0x40028000

#define ETH_MACCR   (ETH_BASE + 0x0)
#define ETH_MACECR  (ETH_BASE + 0x4)
#define ETH_MACPFR  (ETH_BASE + 0x8)
#define ETH_MACWTR  (ETH_BASE + 0xc)
#define ETH_MACHT0R (ETH_BASE + 0x10)
#define ETH_MACHT1R (ETH_BASE + 0x14)

#define ETH_MACVTR     (ETH_BASE + 0x50)
#define ETH_MACVHTR    (ETH_BASE + 0x58)
#define ETH_MACVIR     (ETH_BASE + 0x60)
#define ETH_MACQTXFCR  (ETH_BASE + 0x70)
#define ETH_MACRXFCR   (ETH_BASE + 0x90)
#define ETH_MACISR     (ETH_BASE + 0xb0)
#define ETH_MACIER     (ETH_BASE + 0xb4)
#define ETH_MACRXTXSR  (ETH_BASE + 0xb8)
#define ETH_MACPCSR    (ETH_BASE + 0xc0)
#define ETH_MACWKPFR   (ETH_BASE + 0xc4)
#define ETH_MACLCSR    (ETH_BASE + 0xd0)
#define ETH_MACLTCR    (ETH_BASE + 0xd4)
#define ETH_MACLETR    (ETH_BASE + 0xd8)
#define ETH_MAC1USTCR  (ETH_BASE + 0xdc)
#define ETH_MACVR      (ETH_BASE + 0x110)
#define ETH_MACDR      (ETH_BASE + 0x114)
#define ETH_MACHWF1R   (ETH_BASE + 0x120)
#define ETH_MACHWF2R   (ETH_BASE + 0x124)

#define ETH_MACMDIOAR  (ETH_BASE + 0x200)
#define ETH_MACMDIODR  (ETH_BASE + 0x204)
#define ETH_MACARPAR   (ETH_BASE + 0x210)

#define ETH_MACAHR(x)  (ETH_BASE + 0x300 + 8 * (x))
#define ETH_MACALR(x)  (ETH_BASE + 0x304 + 8 * (x))

#define ETH_MMC_CONTROL       (ETH_BASE + 0x700)
#define ETH_MMC_RX_INTERRUPT  (ETH_BASE + 0x704)
#define ETH_MMC_TX_INTERRUPT  (ETH_BASE + 0x708)
#define ETH_MMC_RX_INTR_MASK  (ETH_BASE + 0x70c)
#define ETH_MMC_TX_INTR_MASK  (ETH_BASE + 0x710)

// MAC management counters. The STM32H7 exposes only this subset.
#define ETH_TX_SINGLE_COLLISION_GOOD_PACKETS   (ETH_BASE + 0x74c)
#define ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS (ETH_BASE + 0x750)
#define ETH_TX_PACKET_COUNT_GOOD               (ETH_BASE + 0x768)
#define ETH_RX_CRC_ERROR_PACKETS               (ETH_BASE + 0x794)
#define ETH_RX_ALIGNMENT_ERROR_PACKETS         (ETH_BASE + 0x798)
#define ETH_RX_UNICAST_PACKETS_GOOD            (ETH_BASE + 0x7c4)
#define ETH_TX_LPI_TRAN_CNTR                   (ETH_BASE + 0x7f0)
#define ETH_RX_LPI_TRAN_CNTR                   (ETH_BASE + 0x7f8)

#define ETH_MACTSCR      (ETH_BASE + 0xb00)
#define ETH_MACSSIR      (ETH_BASE + 0xb04)
#define ETH_MACSTSR      (ETH_BASE + 0xb08)
#define ETH_MACSTNR      (ETH_BASE + 0xb0c)
#define ETH_MACSTSUR     (ETH_BASE + 0xb10)
#define ETH_MACSTNUR     (ETH_BASE + 0xb14)
#define ETH_MACTSAR      (ETH_BASE + 0xb18)
#define ETH_MACTSSR      (ETH_BASE + 0xb20)
#define ETH_MACTXTSSNR   (ETH_BASE + 0xb30)
#define ETH_MACTXTSSSR   (ETH_BASE + 0xb34)
#define ETH_MACACR       (ETH_BASE + 0xb40)
#define ETH_MACATSNR     (ETH_BASE + 0xb48)
#define ETH_MACATSSR     (ETH_BASE + 0xb4c)
#define ETH_MACTSIACR    (ETH_BASE + 0xb50)
#define ETH_MACTSEACR    (ETH_BASE + 0xb54)
#define ETH_MACTSICNR    (ETH_BASE + 0xb58)
#define ETH_MACTSECNR    (ETH_BASE + 0xb5c)
#define ETH_MACPPSCR     (ETH_BASE + 0xb70)
#define ETH_MACPPSTTSR   (ETH_BASE + 0xb80)
#define ETH_MACPPSTTNR   (ETH_BASE + 0xb84)
#define ETH_MACPPSIR     (ETH_BASE + 0xb88)
#define ETH_MACPPSWR     (ETH_BASE + 0xb8c)
#define ETH_MACPOCR      (ETH_BASE + 0xbc0)
#define ETH_MACSPI0R     (ETH_BASE + 0xbc4)
#define ETH_MACSPI1R     (ETH_BASE + 0xbc8)
#define ETH_MACSPI2R     (ETH_BASE + 0xbcc)
#define ETH_MACLMIR      (ETH_BASE + 0xbd0)


#define ETH_MTLOMR       (ETH_BASE + 0xc00)
#define ETH_MTLISR       (ETH_BASE + 0xc20)
#define ETH_MTLTXQOMR    (ETH_BASE + 0xd00)
#define ETH_MTLTXQUR     (ETH_BASE + 0xd04)
#define ETH_MTLTXQDR     (ETH_BASE + 0xd08)
#define ETH_MTLQICSR     (ETH_BASE + 0xd2c)
#define ETH_MTLRXQOMR    (ETH_BASE + 0xd30)
#define ETH_MTLRXQMPOCR  (ETH_BASE + 0xd34)
#define ETH_MTLRXQDR     (ETH_BASE + 0xd38)


#define ETH_DMAMR        (ETH_BASE + 0x1000)
#define ETH_DMASBMR      (ETH_BASE + 0x1004)

#define ETH_DMACCR       (ETH_BASE + 0x1100)
#define ETH_DMACTXCR     (ETH_BASE + 0x1104)
#define ETH_DMACRXCR     (ETH_BASE + 0x1108)

#define ETH_DMACTXDLAR   (ETH_BASE + 0x1114)
#define ETH_DMACRXDLAR   (ETH_BASE + 0x111c)

#define ETH_DMACTXDTPR   (ETH_BASE + 0x1120)
#define ETH_DMACRXDTPR   (ETH_BASE + 0x1128)


#define ETH_DMACTXRLR    (ETH_BASE + 0x112c)
#define ETH_DMACRXRLR    (ETH_BASE + 0x1130)

#define ETH_DMACIER      (ETH_BASE + 0x1134)

#define ETH_DMACSR       (ETH_BASE + 0x1160)



#define ETH_TX_RING_SIZE 8
#define ETH_TX_RING_MASK (ETH_TX_RING_SIZE - 1)

#define ETH_RX_RING_SIZE 16
#define ETH_RX_RING_MASK (ETH_RX_RING_SIZE - 1)

typedef struct stm32h7_eth {
  ether_netif_t se_eni;

  struct pbuf_queue se_rx_scatter_queue;
  int se_rx_scatter_length;

  desc_t *se_txring;
  desc_t *se_rxring;

  void *se_tx_pbuf_data[ETH_TX_RING_SIZE];
  void *se_tx_pbuf[ETH_TX_RING_SIZE];
  void *se_rx_pbuf_data[ETH_RX_RING_SIZE];

  uint8_t se_next_rx; // rename


  uint8_t se_tx_rdptr; // Where DMA currently is
  uint8_t se_tx_wrptr; // Where we will write next TX desc

