andoma/mios/src/platform/stm32h7/stm32h7_eth.c
  uint8_t se_phyaddr;

#ifdef ENABLE_NET_PTP
  uint32_t se_addend;
  int32_t se_ppb_scale_mult;
  int32_t se_ppb_scale_div;
#endif
} stm32h7_eth_t;


static stm32h7_eth_t stm32h7_eth;

static error_t stm32h7_eth_output(struct ether_netif *eni, pbuf_t *pb,
                                  pbuf_tx_cb_t *txcb, uint32_t id);
static void stm32h7_eth_irq(void *arg);



static void
rx_desc_give(stm32h7_eth_t *se, size_t index, void *buf)
{
  assert(buf != NULL);
  se->se_rx_pbuf_data[index] = buf;

  desc_t *rx = se->se_rxring + index;

  rx->p0 = buf + DMA_BUFFER_PAD;
  rx->w3 = ETH_RDES3_OWN | ETH_RDES3_IOC | ETH_RDES3_BUF1V;
  asm volatile ("dsb");
  reg_wr(ETH_DMACRXDTPR, (uint32_t)rx);
}


static void
stm32h7_eth_print_info(struct device *dev, struct stream *st)
{
  stm32h7_eth_t *se = (stm32h7_eth_t *)dev;

  // Packets missed (no Rx descriptor) or dropped on Rx FIFO overflow.
  // The MTL counter is cleared on read, so fold it into the stats.
  const uint32_t mpoc = reg_rd(ETH_MTLRXQMPOCR);
  se->se_eni.eni_stats.rx_hw_qdrop += ((mpoc >> 16) & 0x7ff) + (mpoc & 0x7ff);

  ether_print(&se->se_eni, st);

  // MAC management counters, the subset the STM32H7 exposes. Free
  // running 32 bit, cleared at init. Collisions on a full duplex link
  // and LPI transitions on a PHY without EEE both mean the link partner
  // disagrees with us about the link.
  stprintf(st, "MAC TX  good: %u  single-coll: %u  multi-coll: %u  lpi: %u\n",
           reg_rd(ETH_TX_PACKET_COUNT_GOOD),
           reg_rd(ETH_TX_SINGLE_COLLISION_GOOD_PACKETS),
           reg_rd(ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS),
           reg_rd(ETH_TX_LPI_TRAN_CNTR));
  stprintf(st, "MAC RX  ucast-good: %u  crc: %u  align: %u  lpi: %u\n",
           reg_rd(ETH_RX_UNICAST_PACKETS_GOOD),
           reg_rd(ETH_RX_CRC_ERROR_PACKETS),
           reg_rd(ETH_RX_ALIGNMENT_ERROR_PACKETS),
           reg_rd(ETH_RX_LPI_TRAN_CNTR));
#ifdef ENABLE_NET_PTP
  if(ptp_print_info(st, &se->se_eni)) {
    stprintf(st, "  Hardware time: %u.%u\n",
             reg_rd(ETH_MACSTSR),
             reg_rd(ETH_MACSTNR));
  }
#endif
}


static uint16_t
mii_read(void *arg, uint16_t reg)
{
  stm32h7_eth_t *se = arg;
  int phyaddr = se->se_phyaddr;

  reg_wr(ETH_MACMDIOAR,
         (phyaddr << 21) |
         (reg << 16) |
         (0 << 12) |
         (0 << 8) |
         (3 << 2) |
         (1 << 0));

  while(reg_rd(ETH_MACMDIOAR) & 1) {
    if(can_sleep()) {
      usleep(10);
    }
  }
  return reg_rd(ETH_MACMDIODR) & 0xffff;
}



static void
mii_write(void *arg, uint16_t reg, uint16_t value)
{
  stm32h7_eth_t *se = arg;
  int phyaddr = se->se_phyaddr;

  reg_wr(ETH_MACMDIODR, value);
  reg_wr(ETH_MACMDIOAR,
         (phyaddr << 21) |
         (reg << 16) |
         (1 << 2) |
         (1 << 0));
  while(reg_rd(ETH_MACMDIOAR) & 1) {
    if(can_sleep()) {
      usleep(10);
    }
  }
}


static int
edc_mii_read(ether_netif_t *eni, uint16_t reg)
{
  return mii_read((stm32h7_eth_t *)eni, reg);
}

static error_t
edc_mii_write(ether_netif_t *eni, uint16_t reg, uint16_t value)
{
  mii_write((stm32h7_eth_t *)eni, reg, value);
  return 0;
}

static void
stm32h7_eth_set_link_params(ether_netif_t *eni, int speed, int full_duplex)
{
  uint32_t cr = reg_rd(ETH_MACCR);
  cr &= ~((1 << 14) | (1 << 13)); // Clear FES and DM
  if(speed == 100)
    cr |= (1 << 14);
  if(full_duplex)
    cr |= (1 << 13);
  reg_wr(ETH_MACCR, cr);
}

static const ethmac_device_class_t stm32h7_eth_device_class = {
  .dc = {
    .dc_class_name = MAC_NAME,
    .dc_print_info = stm32h7_eth_print_info,
  },
  .edc_mii_read = edc_mii_read,
  .edc_mii_write = edc_mii_write,
  .edc_set_link_params = stm32h7_eth_set_link_params,
};


#ifdef ENABLE_NET_PTP

static void
stm32h7_clock_set_time(clock_realtime_t *clk, int64_t nsec)
{
  reg_wr(ETH_MACSTSUR, nsec / 1000000000);
  reg_wr(ETH_MACSTNUR, nsec % 1000000000);
  reg_set_bit(ETH_MACTSCR, 2);
  while(reg_get_bit(ETH_MACTSCR, 2));
}

static int64_t
stm32h7_clock_get_time(clock_realtime_t *clk)
{
  while(1) {
    uint32_t s = reg_rd(ETH_MACSTSR);
    uint32_t ns = reg_rd(ETH_MACSTNR);
    if(s == reg_rd(ETH_MACSTSR)) {
      return (int64_t)s * 1000000000 + ns;
    }
  }
}

static void
stm32h7_clock_adj_time(clock_realtime_t *clk, int32_t ppb)
{
  stm32h7_eth_t *se =
    container_of(clk, stm32h7_eth_t, se_eni.eni_ptp.pes_clock);

  int32_t addend_adjustment =
    ((int64_t)ppb * se->se_ppb_scale_mult) / se->se_ppb_scale_div;

  uint32_t final_addend = se->se_addend + addend_adjustment;
  reg_wr(ETH_MACTSAR, final_addend);
  reg_set_bit(ETH_MACTSCR, 5);
}

static const clock_realtime_class_t stm32h7_clock_realtime_class = {
  .name = MAC_NAME,
  .set_time = stm32h7_clock_set_time,
  .get_time = stm32h7_clock_get_time,
  .adj_time = stm32h7_clock_adj_time,
};

static void
stm32h7_ptp_init(stm32h7_eth_t *se)
{
  const unsigned int ahb_freq = clk_get_freq(CLK_ETH1MACEN);

  uint32_t ssinc = (1000000000 / ahb_freq) + 1;

  uint64_t numerator = 1000000000ULL;
  uint64_t denominator = ahb_freq * ssinc;
  se->se_addend = (numerator << 32) / denominator;

  se->se_ppb_scale_mult = se->se_addend / 1000;
  se->se_ppb_scale_div = 1000000;

  reg_wr(ETH_MACTSCR,
         (1 << 11) | // PTPv2 ethernet
         (1 << 10) | // Enable timestamping for PTPv2
         (1 << 9)  | // Rollover ns at 999999999
         (1 << 1)  | // Fine mode
         (1 << 0)  | // Enable
         0);

  reg_set_bits(ETH_MACSSIR, 16, 8, ssinc);

  reg_wr(ETH_MACSTSUR, 0);
  reg_wr(ETH_MACSTNUR, 0);
  reg_set_bit(ETH_MACTSCR, 2);

  reg_wr(ETH_MACTSAR, se->se_addend);
  reg_set_bit(ETH_MACTSCR, 5);
  while(reg_get_bit(ETH_MACTSCR, 5));

  se->se_eni.eni_ptp.pes_clock.clk_class = &stm32h7_clock_realtime_class;
  clock_servo_init(&se->se_eni.eni_ptp.pes_servo,
                   &se->se_eni.eni_ptp.pes_clock);

  reg_wr(ETH_MACPPSCR, 1);
}

#endif

__attribute__((noreturn))
static void
stm32h7_thread(stm32h7_eth_t *se, gpio_t phyrst,
               ethphy_mode_t miimode, uint32_t flags)
{
  device_t *self = &se->se_eni.eni_ni.ni_dev;

  if(phyrst != GPIO_UNUSED) {
    gpio_conf_output(phyrst, GPIO_PUSH_PULL,
                     GPIO_SPEED_LOW, GPIO_PULL_NONE);
    gpio_set_output(phyrst, 0);
    usleep(100000);
    gpio_set_output(phyrst, 1);
    usleep(100000);
  }

