andoma/mios/src/platform/stm32h7/stm32h7_eth.c
  clk_enable(CLK_ETH1MACEN);
  clk_enable(CLK_ETH1TXEN);
  clk_enable(CLK_ETH1RXEN);

  reset_peripheral(CLK_ETH1MACEN);

  ethphy_init_t *init = driver_probe(DRIVER_TYPE_ETHPHY, self);

  if(init == NULL) {
    evlog(LOG_ERR, "%s: No PHY driver found", self->d_name);
    thread_exit(0);
  }

  se->se_eni.eni_phy = init(&se->se_eni, miimode, 0);

  // Soft reset
  reg_set_bit(ETH_DMAMR, 0);

  int i = 0;
  while(reg_rd(ETH_DMAMR) & 1) {
    i++;
    usleep(10);
    if(i == 100) {
      evlog(LOG_ERR, "Ethernet MAC failed to initialize, no clock?");
      thread_exit(0);
    }
  }
  usleep(10);

  // MAC management counters: clear, then mask their half-full
  // interrupts so they never reach MACISR (which the IRQ handler
  // treats as fatal)
  reg_wr(ETH_MMC_CONTROL, 1 << 0); // CNTRST
  reg_wr(ETH_MMC_RX_INTR_MASK,
         (1 << 27) | (1 << 26) | (1 << 17) | (1 << 6) | (1 << 5));
  reg_wr(ETH_MMC_TX_INTR_MASK,
         (1 << 27) | (1 << 26) | (1 << 21) | (1 << 15) | (1 << 14));

#ifdef ENABLE_NET_PTP
  stm32h7_ptp_init(se);
#endif

  // DMA config

  reg_wr(ETH_MACPFR, 1 << 31);  // Receive ALL

  reg_set_bit(ETH_MTLTXQOMR, 1);

  reg_set_bits(ETH_DMACTXCR, 16, 5, 1);

  reg_set_bits(ETH_DMACRXCR, 16, 5, 1);

  reg_set_bits(ETH_DMACRXCR, 1, 14, PBUF_DATA_SIZE - DMA_BUFFER_PAD);

  reg_wr(ETH_DMACTXDLAR, (uint32_t)se->se_txring);
  reg_wr(ETH_DMACTXRLR,  ETH_TX_RING_SIZE - 1);
  reg_wr(ETH_DMACTXDTPR, (uint32_t)se->se_txring);

  reg_wr(ETH_DMACRXDLAR, (uint32_t)se->se_rxring);
  reg_wr(ETH_DMACRXRLR,  ETH_RX_RING_SIZE - 1);

  reg_wr(ETH_DMACIER, (1 << 15) | (1 << 6) | (1 << 2) | (1 << 0));

  reg_set_bit(ETH_MACCR, 21); // CST: Strip CRC for type packets in RX path

  reg_set_bit(ETH_MACCR, 0); // Enable RX
  reg_set_bit(ETH_MACCR, 1); // Enable TX

  // Start DMA
  reg_set_bit(ETH_DMACRXCR, 0);
  reg_set_bit(ETH_DMACTXCR, 0);

  se->se_eni.eni_output = stm32h7_eth_output;

  se->se_eni.eni_ni.ni_flags |=
    NETIF_F_TX_IPV4_CKSUM_OFFLOAD |
    NETIF_F_TX_ICMP_CKSUM_OFFLOAD |
    NETIF_F_TX_UDP_CKSUM_OFFLOAD |
    NETIF_F_TX_TCP_CKSUM_OFFLOAD;

  ether_netif_attach(&se->se_eni);

  irq_enable_fn_arg(61, IRQ_LEVEL_NET, stm32h7_eth_irq, se);

  ethphy_link_poll(&se->se_eni);
}


static void
handle_irq_rx(stm32h7_eth_t *se)
{

  while(1) {
    size_t rx_idx = se->se_next_rx & ETH_RX_RING_MASK;
    desc_t *rx = se->se_rxring + rx_idx;
    const uint32_t w3 = rx->w3;
    if(w3 & ETH_RDES3_OWN)
      break;
    const int len = w3 & 0x7fff;

    if((w3 & (ETH_RDES3_FD | ETH_RDES3_CTX)) == ETH_RDES3_FD)  {
      pbuf_t *pb = STAILQ_FIRST(&se->se_rx_scatter_queue);
      if(pb != NULL) {
        pbuf_free_irq_blocked(pb);
        STAILQ_INIT(&se->se_rx_scatter_queue);
      }
      se->se_rx_scatter_length = 0;
    }

    if(unlikely((w3 & (ETH_RDES3_LD | ETH_RDES3_ES | ETH_RDES3_CTX)) ==
                (ETH_RDES3_LD | ETH_RDES3_ES))) {
      // Errored packet (CRC, RX_ER, overflow, watchdog, giant, dribble).
      // The Rx queue runs in threshold mode so the MTL cannot drop these
      // for us; they arrive truncated or corrupt and must not reach the
      // stack. Drop any earlier segments and recycle this buffer as is.
      pbuf_t *pb = STAILQ_FIRST(&se->se_rx_scatter_queue);
      if(pb != NULL) {
        pbuf_free_irq_blocked(pb);
        STAILQ_INIT(&se->se_rx_scatter_queue);
      }
      se->se_rx_scatter_length = 0;
      if(w3 & ETH_RDES3_CE)
        se->se_eni.eni_stats.rx_crc++;
      else if(w3 & ETH_RDES3_OE)
        se->se_eni.eni_stats.rx_hw_qdrop++;
      else
        se->se_eni.eni_stats.rx_other_err++;
      rx_desc_give(se, rx_idx, se->se_rx_pbuf_data[rx_idx]);
      se->se_next_rx++;
      continue;
    }

    void *buf = se->se_rx_pbuf_data[rx_idx];
    assert(buf != NULL);
    pbuf_t *pb = pbuf_get(0);
    if(pb != NULL) {
      void *nextbuf = pbuf_data_get(0);
      if(nextbuf != NULL) {

        if(unlikely(w3 & ETH_RDES3_CTX)) {

          pbuf_t *pb2 = STAILQ_FIRST(&se->se_rx_scatter_queue);
          if(likely(pb2 != NULL)) {

            pb->pb_flags = PBUF_TIMESTAMP | PBUF_SOP;
            pb->pb_pktlen = pb2->pb_pktlen + sizeof(pbuf_timestamp_t);
            pb->pb_offset = 0;
            pb->pb_buflen = sizeof(pbuf_timestamp_t);

            pb->pb_data = buf;
            pbuf_timestamp_t *pt = buf;
            pt->pt_cb = NULL; // Callbacks are used with TX
            pt->pt_seconds = rx->w1;
            pt->pt_nanoseconds = rx->w0;

            pb2->pb_flags &= ~PBUF_SOP;

            STAILQ_INSERT_TAIL(&se->se_eni.eni_ni.ni_rx_queue, pb, pb_link);
            STAILQ_CONCAT(&se->se_eni.eni_ni.ni_rx_queue,
                          &se->se_rx_scatter_queue);
            netif_wakeup(&se->se_eni.eni_ni);
          } else {
            pbuf_put(pb);
            pbuf_data_put(buf);
          }
        } else {
          int flags = 0;
          int tsa = 0;

          if(w3 & ETH_RDES3_FD) {
            flags |= PBUF_SOP;
            pb->pb_offset = 2;
          } else {
            pb->pb_offset = 0;
          }
          if(w3 & ETH_RDES3_LD) {
            flags |= PBUF_EOP;
            if(w3 & (1 << 26)) {
              // RDES1 is valid
              if(rx->w1 & (1 << 14)) {
                // Time stamp available
                tsa = 1;
              }
            }
          }

          pb->pb_data = buf;
          pb->pb_flags = flags;

          if((flags == (PBUF_SOP | PBUF_EOP)) && likely(!tsa)) {
            pb->pb_buflen = len;
            pb->pb_pktlen = len;
            se->se_eni.eni_stats.rx_pkt++;
            se->se_eni.eni_stats.rx_byte += len;
            STAILQ_INSERT_TAIL(&se->se_eni.eni_ni.ni_rx_queue, pb, pb_link);
            netif_wakeup(&se->se_eni.eni_ni);
          } else {

            assert(pb->pb_data != NULL);
            STAILQ_INSERT_TAIL(&se->se_rx_scatter_queue, pb, pb_link);

            pb->pb_buflen = len - se->se_rx_scatter_length;

            if(flags & PBUF_EOP) {
              pbuf_t *first = STAILQ_FIRST(&se->se_rx_scatter_queue);
              first->pb_pktlen = len;

              if(likely(!tsa)) {
                se->se_eni.eni_stats.rx_pkt++;
                se->se_eni.eni_stats.rx_byte += len;
                STAILQ_CONCAT(&se->se_eni.eni_ni.ni_rx_queue,
                              &se->se_rx_scatter_queue);
                netif_wakeup(&se->se_eni.eni_ni);
              }

            } else {
              se->se_rx_scatter_length = len;
            }
          }
        }
        buf = nextbuf;
      } else {
        se->se_eni.eni_stats.rx_sw_qdrop++;
        pbuf_put(pb);
      }
    } else {
    }
    rx_desc_give(se, se->se_next_rx & ETH_RX_RING_MASK, buf);
    se->se_next_rx++;
  }
}


static void
handle_irq_tx(stm32h7_eth_t *se)
{
  while(se->se_tx_rdptr != se->se_tx_wrptr) {
    const size_t rdptr = se->se_tx_rdptr & ETH_TX_RING_MASK;
    desc_t *tx = se->se_txring + rdptr;

