andoma/mios/src/platform/stm32h7/stm32h7_eth.c
    const uint32_t w3 = tx->w3;
    if(w3 & ETH_TDES3_OWN)
      break;

    // TDES2 is not touched by the write-back, B1L is still the segment
    // length. Count the packet on its first segment, bytes on every one.
    if(w3 & ETH_TDES3_FD)
      se->se_eni.eni_stats.tx_pkt++;
    se->se_eni.eni_stats.tx_byte += tx->w2 & 0x3fff;

    pbuf_t *pb = se->se_tx_pbuf[rdptr];
    if(pb != NULL) {
      // tx-callback is now in (reused) pbuf_t
      // Reuse pbuf_t for queue-link and fill out pbuf_timestamp_t
      // in data, and enqueue back to network stack

      pbuf_timestamp_t *s = se->se_tx_pbuf[rdptr];
      pbuf_timestamp_t *pt = se->se_tx_pbuf_data[rdptr];
      pt->pt_cb = s->pt_cb;
      pt->pt_id = s->pt_id;
      pt->pt_seconds = tx->w1;
      pt->pt_nanoseconds = tx->w0;

      pbuf_t *pb = (pbuf_t *)s;
      pb->pb_flags = PBUF_SOP | PBUF_EOP | PBUF_TIMESTAMP;
      pb->pb_offset = 0;
      pb->pb_buflen = sizeof(pbuf_timestamp_t);
      pb->pb_pktlen = pb->pb_buflen;
      pb->pb_data = pt;

      STAILQ_INSERT_TAIL(&se->se_eni.eni_ni.ni_rx_queue, pb, pb_link);
      netif_wakeup(&se->se_eni.eni_ni);

    } else {
      pbuf_data_put(se->se_tx_pbuf_data[rdptr]);
    }

    se->se_tx_rdptr++;
  }
}


static error_t
stm32h7_eth_output(struct ether_netif *eni, pbuf_t *pb,
                   pbuf_tx_cb_t *txcb, uint32_t id)
{
  stm32h7_eth_t *se = (stm32h7_eth_t *)eni;
  pbuf_t *n;
  size_t count = 0;

  for(n = pb; n != NULL; n = n->pb_next) {
    count++;
  }

  int q = irq_forbid(IRQ_LEVEL_NET);
  int wrptr = se->se_tx_wrptr;
  const uint8_t qlen = (wrptr - se->se_tx_rdptr) & 0xff;

  if(qlen + count >= ETH_TX_RING_SIZE) {
    pbuf_free_irq_blocked(pb);
    eni->eni_stats.tx_qdrop++;
    irq_permit(q);
    return ERR_QUEUE_FULL;
  }

  for(; pb != NULL; pb = n) {
    n = STAILQ_NEXT(pb, pb_link);

    desc_t *tx = se->se_txring + (wrptr & ETH_TX_RING_MASK);
    se->se_tx_pbuf_data[wrptr & ETH_TX_RING_MASK] = pb->pb_data;

    tx->p0 = pb->pb_data + pb->pb_offset;
    tx->w1 = 0;

    uint32_t w3 = ETH_TDES3_OWN | pb->pb_pktlen;
    uint32_t w2 = (1 << 31) | pb->pb_buflen;

    w3 |= (0b11 << 16); // Calculate and insert checksums

    if(pb->pb_flags & PBUF_SOP) {
      w3 |= ETH_TDES3_FD;
      if(unlikely(txcb != NULL)) {
        w2 |= (1 << 30); // Enable timestamping
      }
    }

    tx->w2 = w2;

    if(pb->pb_flags & PBUF_EOP) {
      w3 |= ETH_TDES3_LD;
      if(unlikely(txcb != NULL)) {
        // Reuse pbuf_t for tx callback and id
        pbuf_timestamp_t *pt = (pbuf_timestamp_t *)pb;
        pt->pt_cb = txcb;
        pt->pt_id = id;
        se->se_tx_pbuf[wrptr & ETH_TX_RING_MASK] = pb;
        pb = NULL;
      }
    }
    if(pb != NULL) {
      pbuf_put(pb);
      se->se_tx_pbuf[wrptr & ETH_TX_RING_MASK] = NULL;
    }
    tx->w3 = w3;
    wrptr++;
  }

  desc_t *tx = se->se_txring + (wrptr & ETH_TX_RING_MASK);
  asm volatile ("dsb");
  reg_wr(ETH_DMACTXDTPR, (uint32_t)tx);

  se->se_tx_wrptr = wrptr;
  irq_permit(q);
  return 0;
}





static void
stm32h7_eth_irq(void *arg)
{
  stm32h7_eth_t *se = arg;

  const uint32_t dmacsr = reg_rd(ETH_DMACSR);
  //  const uint32_t mtlisr = reg_rd(ETH_MTLISR);
  const uint32_t macisr = reg_rd(ETH_MACISR);

  if(dmacsr & ~0x8cc5) {
    panic("%s: Unhandled dmairq 0x%x", __FUNCTION__, dmacsr & ~0x8cc5);
  }

  if(dmacsr & 0x5)
    handle_irq_tx(se);

  if(dmacsr & 0x40)
    handle_irq_rx(se);

  if(dmacsr & 0x80) {
    panic("RX underflow, game over 0x%x\n", macisr);
  } else {

    //    assert(mtlisr == 0);
    if(macisr)
      panic("macisr:0x%x", macisr);
  }

  reg_wr(ETH_DMACSR, dmacsr);
}


void
stm32h7_eth_init(gpio_t phyrst, const uint8_t *gpios, size_t gpio_count,
                 int phy_addr, ethphy_mode_t mode, int flags)
{
  stm32h7_eth_t *se = &stm32h7_eth;

  se->se_phyaddr = phy_addr;

  ether_netif_init(&se->se_eni, "eth0", &stm32h7_eth_device_class);

  clk_enable(CLK_SYSCFG);

  if(mode == ETHPHY_MODE_RMII) {
    reg_set_bits(SYSCFG_BASE + 0x4, 21, 3, 4);
  } else {
    reg_set_bits(SYSCFG_BASE + 0x4, 21, 3, 0);
  }

  for(size_t i = 0; i < gpio_count; i++) {
    gpio_conf_af(gpios[i], 11, GPIO_PUSH_PULL,
                 GPIO_SPEED_VERY_HIGH, GPIO_PULL_NONE);
  }

  se->se_eni.eni_addr[0] = 0x02;
  se->se_eni.eni_addr[1] = 0x00;

  uint32_t uuidcrc = crc32(0, (void *)0x1ff1e800, 12);
  memcpy(&se->se_eni.eni_addr[2], &uuidcrc, 4);

  se->se_tx_wrptr = 0;
  se->se_next_rx = 0;
  STAILQ_INIT(&se->se_rx_scatter_queue);
  se->se_txring = xalloc(sizeof(desc_t) * ETH_TX_RING_SIZE, 0,
                         MEM_CLEAR | MEM_TYPE_DMA | MEM_TYPE_NO_CACHE);
  se->se_rxring = xalloc(sizeof(desc_t) * ETH_RX_RING_SIZE, 0,
                         MEM_CLEAR | MEM_TYPE_DMA | MEM_TYPE_NO_CACHE);

  for(int i = 0; i < ETH_RX_RING_SIZE; i++) {
    void *buf = pbuf_data_get(0);
    if(buf == NULL)
      panic("no pbufs");
    rx_desc_give(se, i, buf);
  }

  thread_createv(stm32h7_thread, 512, "eth", 0, 4, se, phyrst, mode, flags);
}

